app/app/controllers/users_controller.rb

SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 AND "users"."email" = $2 LIMIT 1  [["username", "Slavkata"], ["email", "slavkirilov00@gmail.com"]]
INSERT INTO "users" ("username", "password", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Slavkata"], ["password", "1947cska"], ["email", "slavkirilov00@gmail.com"], ["created_at", "2017-03-04 20:20:26.778719"], ["updated_at", "2017-03-04 20:20:26.778719"]]
---
  def create
    @user = User.new
    if !User.exists?(username: params[:user][:username], email: params[:user][:email]) then
        if params[:user][:username] != "" && params[:user][:email] != "" && params[:user][:password] != "" then
          @user.username = params[:user][:username]
          @user.password = params[:user][:password]
          @user.email = params[:user][:email]
          @user.save

SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 AND "users"."password" = $2 LIMIT 1  [["username", "Slavkata"], ["password", "1947cska"]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "Slavkata"]]
---
  def Login
    if User.exists?(username: params[:user][:username], password: params[:user][:password])